app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "alex@email.com"], ["LIMIT", 1]]
---
  def do_login
    if params[:email].blank?
      redirect_to login_admin_users_path, alert: "Voce precisa digitar um email"
    else
      if params[:senha].blank?
        redirect_to login_admin_users_path, alert: "digite senha"
      else
        user = User.find_by_email params[:email]