app/controllers/application_controller.rb

  def current_user
    @current_user ||= User.find_by_email_and_id(session[:email], session[:uid])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 AND "users"."id" = $2 LIMIT $3  [["email", "alex@email.com"], ["id", 2], ["LIMIT", 1]]