app/controllers/comments_controller.rb

INSERT INTO "comments" ("post_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 1], ["body", "teste de comentario"], ["created_at", "2021-11-26 02:05:02.515391"], ["updated_at", "2021-11-26 02:05:02.515391"]]
---
  def create
    @post.comments.create! comments_params