app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"